#### Terraform working directory 🏠: `demo/demo-account/network/vpc`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.vpc.module.default_endpoints["VPC-SGP-TST-C-1"].aws_vpc_endpoint.this["dynamodb"] will be destroyed
  # (because key ["dynamodb"] is not in for_each map)
  - resource "aws_vpc_endpoint" "this" {
      - arn                   = "arn:aws:ec2:ap-southeast-1:129980683758:vpc-endpoint/vpce-0858c52307756d718" -> null
      - cidr_blocks           = [
          - "35.71.118.0/25",
          - "52.94.11.0/24",
          - "35.71.118.128/26",
        ] -> null
      - dns_entry             = [] -> null
      - id                    = "vpce-0858c52307756d718" -> null
      - network_interface_ids = [] -> null
      - owner_id              = "129980683758" -> null
      - policy                = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - prefix_list_id        = "pl-67a5400e" -> null
      - private_dns_enabled   = false -> null
      - requester_managed     = false -> null
      - route_table_ids       = [
          - "rtb-054aecb69f4eed8bd",
          - "rtb-0ebabc934b5458a86",
        ] -> null
      - security_group_ids    = [] -> null
      - service_name          = "com.amazonaws.ap-southeast-1.dynamodb" -> null
      - state                 = "available" -> null
      - subnet_ids            = [] -> null
      - tags                  = {
          - "Name" = "com.amazonaws.ap-southeast-1.dynamodb"
        } -> null
      - tags_all              = {
          - "Name" = "com.amazonaws.ap-southeast-1.dynamodb"
        } -> null
      - vpc_endpoint_type     = "Gateway" -> null
      - vpc_id                = "vpc-0e57c5429432ceedd" -> null

      - timeouts {
          - create = "10m" -> null
          - delete = "10m" -> null
          - update = "10m" -> null
        }
    }

  # module.vpc.module.default_endpoints["VPC-SGP-TST-C-1"].aws_vpc_endpoint.this["dynamodb_gateway_default"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = [
          + "rtb-054aecb69f4eed8bd",
          + "rtb-0ebabc934b5458a86",
        ]
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-southeast-1.dynamodb"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "dynamodb_gateway"
        }
      + tags_all              = {
          + "Name" = "dynamodb_gateway"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "vpc-0e57c5429432ceedd"

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc.module.default_endpoints["VPC-SGP-TST-C-1"].aws_vpc_endpoint.this["s3"] will be destroyed
  # (because key ["s3"] is not in for_each map)
  - resource "aws_vpc_endpoint" "this" {
      - arn                   = "arn:aws:ec2:ap-southeast-1:129980683758:vpc-endpoint/vpce-01c127b2b44a65694" -> null
      - cidr_blocks           = [
          - "52.219.32.0/21",
          - "3.5.146.0/23",
          - "18.34.248.0/22",
          - "3.5.148.0/22",
          - "18.34.64.0/21",
          - "52.219.40.0/22",
          - "52.219.124.0/22",
          - "52.219.128.0/21",
          - "52.219.184.0/21",
          - "16.12.48.0/21",
          - "52.219.164.0/22",
          - "52.219.180.0/22",
        ] -> null
      - dns_entry             = [] -> null
      - id                    = "vpce-01c127b2b44a65694" -> null
      - network_interface_ids = [] -> null
      - owner_id              = "129980683758" -> null
      - policy                = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - prefix_list_id        = "pl-6fa54006" -> null
      - private_dns_enabled   = false -> null
      - requester_managed     = false -> null
      - route_table_ids       = [
          - "rtb-054aecb69f4eed8bd",
          - "rtb-0ebabc934b5458a86",
        ] -> null
      - security_group_ids    = [] -> null
      - service_name          = "com.amazonaws.ap-southeast-1.s3" -> null
      - state                 = "available" -> null
      - subnet_ids            = [] -> null
      - tags                  = {
          - "Name" = "com.amazonaws.ap-southeast-1.s3"
        } -> null
      - tags_all              = {
          - "Name" = "com.amazonaws.ap-southeast-1.s3"
        } -> null
      - vpc_endpoint_type     = "Gateway" -> null
      - vpc_id                = "vpc-0e57c5429432ceedd" -> null

      - timeouts {
          - create = "10m" -> null
          - delete = "10m" -> null
          - update = "10m" -> null
        }
    }

  # module.vpc.module.default_endpoints["VPC-SGP-TST-C-1"].aws_vpc_endpoint.this["s3_gateway_default"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = [
          + "rtb-054aecb69f4eed8bd",
          + "rtb-0ebabc934b5458a86",
        ]
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-southeast-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "s3_gateway"
        }
      + tags_all              = {
          + "Name" = "s3_gateway"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "vpc-0e57c5429432ceedd"

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-05079dc5df8043f20"
      ~ tags             = {
          ~ "Name"           = "Eric-Test-VPC-Private-RT" -> "Eric-Test-VPC-Private-RT-a"
            "RouteTableType" = "private"
        }
      ~ tags_all         = {
          ~ "Name"           = "Eric-Test-VPC-Private-RT" -> "Eric-Test-VPC-Private-RT-a"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_route_table.private[1] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-01044fc6f4049a5c4"
      ~ tags             = {
          ~ "Name"           = "Eric-Test-VPC-Private-RT" -> "Eric-Test-VPC-Private-RT-b"
            "RouteTableType" = "private"
        }
      ~ tags_all         = {
          ~ "Name"           = "Eric-Test-VPC-Private-RT" -> "Eric-Test-VPC-Private-RT-b"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
